[bits 32]
[SECTION .text]

;============================================================================
; 从某个 16 位端口读取一个字节
; 参数1: 端口号
; 返回： 读取到的字节
;============================================================================
global in_byte
in_byte:
    push ebp
    mov ebp, esp
    mov edx, [esp + 8] ; 32 位下，栈每次取 4 字节，要用 edx 取参数

    xor eax, eax ; 清空 eax 寄存器
    in al, dx
    
    mov esp, ebp
    pop ebp

    ret

;============================================================================
; 向某个 16 位端口写入一个字节
; 参数1: 端口号
; 参数2: 要写入的字节
;============================================================================
global out_byte
out_byte:
    push ebp
    mov ebp, esp

    mov edx, [esp + 8]    ; 端口号
    mov eax, [esp + 12]   ; 要写入的字节，取 al
    out dx, al

    mov esp, ebp
    pop ebp

    ret

;============================================================================
; 从某个 16 位端口读取一个字
; 参数1: 端口号
; 返回： 读取到的字
;============================================================================
global in_word
in_word:
    push ebp
    mov ebp, esp

    mov edx, [esp + 8]

    xor eax, eax
    in ax, dx

    mov esp, ebp
    pop ebp

    ret

;============================================================================
; 向某个 16 位端口写入一个字
; 参数1: 端口号
; 参数2: 要写入的字
;=============================================================================
global out_word
out_word:
    push ebp
    mov ebp, esp

    mov edx, [esp + 8]
    mov eax, [esp + 12]
    out dx, ax
    
    mov esp, ebp
    pop ebp

    ret